## 데이터 병합

### concat
- 데이터프레임을 물리적으로 이어 붙이는 함수
- pd.concat(데이터프레임리스트)
- join = inner 옵션으로 교집합으로 붙일 수 있음, outer(합집합)이 디폴트

In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({'A':[1, 2, 3], 'B':[4,5,6]})
df2 = pd.DataFrame({'A':[7,8], 'B':[9,10]})

In [3]:
display(df1)
display(df2)

   A  B
0  1  4
1  2  5
2  3  6

   A   B
0  7   9
1  8  10

In [4]:
#axis=0은 행방향으로 붙이기
pd.concat([df1, df2], axis=0, ignore_index=True)

   A   B
0  1   4
1  2   5
2  3   6
3  7   9
4  8  10

In [5]:
pd.concat([df1, df2], axis=0, ignore_index=False)

   A   B
0  1   4
1  2   5
2  3   6
0  7   9
1  8  10

In [6]:
#axis=1은 열방향으로 붙이기
pd.concat([df1, df2], axis=1, ignore_index=True)

   0  1    2     3
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

In [7]:
#만약 두 데이터 프레임 인덱스가 다르다면 중복되는 인덱스들끼리 붙고 나머지는 NaN
pd.concat([df1, df2], axis=1, ignore_index=False)

   A  B    A     B
0  1  4  7.0   9.0
1  2  5  8.0  10.0
2  3  6  NaN   NaN

### merge
- 공통된 컬럼을 기준으로 데이터프레임 병합
- pd.merge(df_left, df_right, how='inner', on=None)이 default

In [8]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,3], "C":[9,10,11]})

In [9]:
display(df1)
display(df2)

   A  B
0  1  4
1  2  5
2  3  6

   A   C
0  1   9
1  2  10
2  3  11

In [10]:
pd.merge(df1, df2, on='A')

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [11]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6]})
df2 = pd.DataFrame({'A':[1,2,4], "C":[9,10,11]})

In [13]:
pd.merge(df1, df2, on='A')

   A  B   C
0  1  4   9
1  2  5  10

In [19]:
pd.merge(df1, df2, left_on='A', right_on='A')

   A  B   C
0  1  4   9
1  2  5  10

In [20]:
#조인하고 싶은 컬럼이 두개 이상인 경우
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'A':[1,2,4], "C":[9,10,11],'D':[500,600,700]})

In [21]:
display(df1)
display(df2)

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

   A   C    D
0  1   9  500
1  2  10  600
2  4  11  700

In [22]:
pd.merge(df1, df2, on=['A','C'])

   A  B   C    D
0  1  4   9  500
1  2  5  10  600

In [24]:
pd.merge(df1, df2, on='A')
#공통 컬럼이 양쪽에 다 있으니까 구분해서 표시됨

   A  B  C_x  C_y    D
0  1  4    9    9  500
1  2  5   10   10  600

In [26]:
df2.rename({'A':'abc'}, axis=1, inplace=True)

In [27]:
df1

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

In [28]:
df2

   abc   C    D
0    1   9  500
1    2  10  600
2    4  11  700

In [29]:
pd.merge(df1, df2, left_on=['A'], right_on=['abc'])
#각각 지정해준 컬럼에서 중복되는 것 기준으로 병합

   A  B  C_x  abc  C_y    D
0  1  4    9    1    9  500
1  2  5   10    2   10  600

In [30]:
pd.merge(df1, df2, left_on=['A', 'C'], right_on=['abc', 'C'])

   A  B   C  abc    D
0  1  4   9    1  500
1  2  5  10    2  600

In [31]:
df2.rename({'C':'efg'}, axis=1, inplace=True)

In [32]:
pd.merge(df1,df2, left_on=['A','C'],right_on=['abc','efg'])

   A  B   C  abc  efg    D
0  1  4   9    1    9  500
1  2  5  10    2   10  600

In [33]:
df1 = pd.DataFrame({'A':[1,2,3], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [34]:
display(df1)
display(df2)

   A  B   C
0  1  4   9
1  2  5  10
2  3  6  11

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [35]:
df1. set_index('A', inplace=True)

In [36]:
df1

   B   C
A
1  4   9
2  5  10
3  6  11

In [37]:
pd.merge(df1, df2, left_index=True, right_on='abc')
#df1의 인덱스와 df2의 abc 컬럼에서 중복되는 값 기준으로 병합
#df1의 1행 3행, df2의 1행 2행

   B   C  abc  efg    D
0  4   9    1    9  500
1  6  11    3   10  600

In [38]:
df1 = pd.DataFrame({'A':[10,20,30], "B":[4,5,6],"C":[9,10,11]})
df2 = pd.DataFrame({'abc':[1,3,4], "efg":[9,10,11],'D':[500,600,700]})

In [39]:
display(df1)
display(df2)

    A  B   C
0  10  4   9
1  20  5  10
2  30  6  11

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [40]:
df1.set_index('A', inplace=True)

In [41]:
display(df1)
display(df2)

    B   C
A
10  4   9
20  5  10
30  6  11

   abc  efg    D
0    1    9  500
1    3   10  600
2    4   11  700

In [42]:
pd.merge(df1,df2,left_index = True, right_on ='abc')
#df1의 인덱스와 df2의 abc에 중복되는 값이 없으니까 병합 안됨

Empty DataFrame
Columns: [B, C, abc, efg, D]
Index: []

### how

In [43]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3]})
df2 = pd.DataFrame({'A':[2,3,4], 'y':[2,3,4]})

In [44]:
display(df1)
display(df2)

   A  x
0  1  1
1  2  2
2  3  3

   A  y
0  2  2
1  3  3
2  4  4

In [45]:
pd.merge(df1, df2, on='A', how='inner')

   A  x  y
0  2  2  2
1  3  3  3

In [46]:
pd.merge(df1, df2, on='A',how='left')
#df2에는 A컬럼의 1값이 없으니까 NaN

   A  x    y
0  1  1  NaN
1  2  2  2.0
2  3  3  3.0

In [47]:
pd.merge(df1, df2, on='A',how='right')

   A    x  y
0  2  2.0  2
1  3  3.0  3
2  4  NaN  4

In [48]:
pd.merge(df1, df2, on='A',how='outer')
#합집합 개념

   A    x    y
0  1  1.0  NaN
1  2  2.0  2.0
2  3  3.0  3.0
3  4  NaN  4.0

In [49]:
df1 = pd.DataFrame({'A':[1,2,3], 'x':[1,2,3],'c':[10,20,30]})
df2 = pd.DataFrame({'A':[2,3,4], 'x':[2,7,4],'d':[100,200,300]})

In [50]:
pd.merge(df1, df2, on=['A','x'], how='inner')

   A  x   c    d
0  2  2  20  100